klaslofstedt/stm32f4_hal_quadcopter/Src/em7180.c
uint8_t errorStatus;
static void M24512DFMreadBytes(uint8_t device_address, uint8_t data_address1, uint8_t data_address2, uint8_t count, uint8_t *dest);
static void ReadBytes(uint8_t address, uint8_t subAddress, uint8_t count, uint8_t *dest);
static uint8_t ReadByte(uint8_t address, uint8_t subAddress);
static void WriteByte(uint8_t address, uint8_t subAddress, uint8_t data);
static void ReadThreeAxis(uint8_t xreg, int16_t *x, int16_t *y, int16_t *z);



void WriteByte(uint8_t address, uint8_t subAddress, uint8_t data)
{
    uint8_t data_send[2];
    data_send[0] = subAddress;
    data_send[1] = data;
    
    //xSemaphoreTake(xMutexI2C, portMAX_DELAY);
    HAL_I2C_Master_Transmit(&hi2c3, (uint16_t)address << 1, data_send, 2, 1000);
    //xSemaphoreGive(xMutexI2C);
    //HAL_I2C_Mem_Write(&hi2c3, (uint16_t)address << 1, (uint16_t)subAddress, 1, /* &?*/data, 1, 1000);
}

uint8_t ReadByte(uint8_t address, uint8_t subAddress)
{
    uint8_t data_receive;
    
    //xSemaphoreTake(xMutexI2C, portMAX_DELAY);
    uint8_t HAL_return = HAL_I2C_Mem_Read(&hi2c3, (uint16_t)address << 1, subAddress, 1, &data_receive, 1, 1000);
    //xSemaphoreGive(xMutexI2C);
    
    return data_receive;
}

void ReadBytes(uint8_t address, uint8_t subAddress, uint8_t count, uint8_t *data_receive)
{  
    //xSemaphoreTake(xMutexI2C, portMAX_DELAY);
    HAL_I2C_Mem_Read(&hi2c3, (uint16_t)address << 1, subAddress, 1, data_receive, count, 1000);
    //xSemaphoreGive(xMutexI2C);
}

float uint32_RegToFloat (uint8_t *buf)
{
    union {
        uint32_t ui32;
        float f;
    } u;
    
    u.ui32 =     (((uint32_t)buf[0]) +
                  (((uint32_t)buf[1]) <<  8) +
                      (((uint32_t)buf[2]) << 16) +
                          (((uint32_t)buf[3]) << 24));
    return u.f;
}

void SetIntegerParam(uint8_t param, uint32_t param_val) 
{
    uint8_t bytes[4], STAT;
    bytes[0] = param_val & (0xFF);
    bytes[1] = (param_val >> 8) & (0xFF);
    bytes[2] = (param_val >> 16) & (0xFF);
    bytes[3] = (param_val >> 24) & (0xFF);
    param = param | 0x80; //Parameter is the decimal value with the MSB set high to indicate a paramter write processs
    WriteByte(EM7180_ADDRESS, EM7180_LoadParamByte0, bytes[0]); //Param LSB
    WriteByte(EM7180_ADDRESS, EM7180_LoadParamByte1, bytes[1]);
    WriteByte(EM7180_ADDRESS, EM7180_LoadParamByte2, bytes[2]);
    WriteByte(EM7180_ADDRESS, EM7180_LoadParamByte3, bytes[3]); //Param MSB
    WriteByte(EM7180_ADDRESS, EM7180_ParamRequest, param);
    WriteByte(EM7180_ADDRESS, EM7180_AlgorithmControl, 0x80); //Request parameter transfer procedure
    STAT = ReadByte(EM7180_ADDRESS, EM7180_ParamAcknowledge); //Check the parameter acknowledge register and loop until the result matches parameter request byte
    while(!(STAT==param)) {
        STAT = ReadByte(EM7180_ADDRESS, EM7180_ParamAcknowledge);
    }
    WriteByte(EM7180_ADDRESS, EM7180_ParamRequest, 0x00); //Parameter request = 0 to end parameter transfer process
    WriteByte(EM7180_ADDRESS, EM7180_AlgorithmControl, 0x00); // Re-start algorithm
}

void SetMagAccFs(uint16_t mag_fs, uint16_t acc_fs) 
{
    uint8_t bytes[4], STAT;
    bytes[0] = mag_fs & (0xFF);
    bytes[1] = (mag_fs >> 8) & (0xFF);
    bytes[2] = acc_fs & (0xFF);
    bytes[3] = (acc_fs >> 8) & (0xFF);
    WriteByte(EM7180_ADDRESS, EM7180_LoadParamByte0, bytes[0]); //Mag LSB
    WriteByte(EM7180_ADDRESS, EM7180_LoadParamByte1, bytes[1]); //Mag MSB
    WriteByte(EM7180_ADDRESS, EM7180_LoadParamByte2, bytes[2]); //Acc LSB
    WriteByte(EM7180_ADDRESS, EM7180_LoadParamByte3, bytes[3]); //Acc MSB
    WriteByte(EM7180_ADDRESS, EM7180_ParamRequest, 0xCA); //Parameter 74; 0xCA is 74 decimal with the MSB set high to indicate a paramter write processs
    WriteByte(EM7180_ADDRESS, EM7180_AlgorithmControl, 0x80); //Request parameter transfer procedure
    STAT = ReadByte(EM7180_ADDRESS, EM7180_ParamAcknowledge); //Check the parameter acknowledge register and loop until the result matches parameter request byte
    while(!(STAT==0xCA)) {
        STAT = ReadByte(EM7180_ADDRESS, EM7180_ParamAcknowledge);
    }
    WriteByte(EM7180_ADDRESS, EM7180_ParamRequest, 0x00); //Parameter request = 0 to end parameter transfer process
    WriteByte(EM7180_ADDRESS, EM7180_AlgorithmControl, 0x00); // Re-start algorithm
}

void SetGyroFs(uint16_t gyro_fs) 
{
    uint8_t bytes[4], STAT;
    bytes[0] = gyro_fs & (0xFF);
    bytes[1] = (gyro_fs >> 8) & (0xFF);
    bytes[2] = 0x00;
    bytes[3] = 0x00;
    WriteByte(EM7180_ADDRESS, EM7180_LoadParamByte0, bytes[0]); //Gyro LSB
    WriteByte(EM7180_ADDRESS, EM7180_LoadParamByte1, bytes[1]); //Gyro MSB
    WriteByte(EM7180_ADDRESS, EM7180_LoadParamByte2, bytes[2]); //Unused
    WriteByte(EM7180_ADDRESS, EM7180_LoadParamByte3, bytes[3]); //Unused
    WriteByte(EM7180_ADDRESS, EM7180_ParamRequest, 0xCB); //Parameter 75; 0xCB is 75 decimal with the MSB set high to indicate a paramter write processs
    WriteByte(EM7180_ADDRESS, EM7180_AlgorithmControl, 0x80); //Request parameter transfer procedure
    STAT = ReadByte(EM7180_ADDRESS, EM7180_ParamAcknowledge); //Check the parameter acknowledge register and loop until the result matches parameter request byte
    while(!(STAT==0xCB)) {
        STAT = ReadByte(EM7180_ADDRESS, EM7180_ParamAcknowledge);
    }
    WriteByte(EM7180_ADDRESS, EM7180_ParamRequest, 0x00); //Parameter request = 0 to end parameter transfer process
    WriteByte(EM7180_ADDRESS, EM7180_AlgorithmControl, 0x00); // Re-start algorithm
}

// I2C communication with the M24512DFM EEPROM is a little different from I2C communication with the usual motion sensor
// since the address is defined by two bytes

//TODO: might wanna swap data_address1 & data_address2
void M24512DFMreadBytes(uint8_t address, uint8_t data_address1, uint8_t data_address2, uint8_t count, uint8_t *data_receive)
{   
    uint16_t data_address = ((uint16_t)data_address1 << 8) | data_address2;
    HAL_I2C_Mem_Read(&hi2c3, (uint16_t)address << 1, data_address, 2, (uint8_t *)&data_receive, count, 1000);
}

bool HasFeature(uint8_t features)
{
    return features & ReadByte(EM7180_ADDRESS, EM7180_FeatureFlags);
}

bool AlgorithmStatus(uint8_t status)
{
    return ReadByte(EM7180_ADDRESS, EM7180_AlgorithmStatus) & status;
}

/*static volatile bool newData;

void interruptHandler()
{
newData = true;
}*/

// public methods ========================================================================================================

bool EM7180_EEPROM(void)
{
    errorStatus = 0;
    // Check SENtral status, make sure EEPROM upload of firmware was accomplished
    for (int attempts=0; attempts < 10; ++attempts) {
        if (ReadByte(EM7180_ADDRESS, EM7180_SentralStatus) & 0x01) {
            if(ReadByte(EM7180_ADDRESS, EM7180_SentralStatus) & 0x01) { }
            if(ReadByte(EM7180_ADDRESS, EM7180_SentralStatus) & 0x02) { }
            if(ReadByte(EM7180_ADDRESS, EM7180_SentralStatus) & 0x04) {
                errorStatus = 0xB0;
                return false;
            }
            if(ReadByte(EM7180_ADDRESS, EM7180_SentralStatus) & 0x08) { }
            if(ReadByte(EM7180_ADDRESS, EM7180_SentralStatus) & 0x10) {
                errorStatus = 0xB0;
                return false;
            }
            break;
        }
        WriteByte(EM7180_ADDRESS, EM7180_ResetRequest, 0x01);
        osDelay(500);  
    }
    
    
    if (ReadByte(EM7180_ADDRESS, EM7180_SentralStatus) & 0x04) {
        errorStatus = 0xB0;
        return false;
    }
    
