klaslofstedt/stm32f4_hal_quadcopter/Src/em7180.c
    return true;
}

const char *EM7180_GetErrorString(void)
{
    if (errorStatus & 0x01) return "Magnetometer error";
    if (errorStatus & 0x02) return "Accelerometer error";
    if (errorStatus & 0x04) return "Gyro error";
    if (errorStatus & 0x10) return "Magnetometer ID not recognized";
    if (errorStatus & 0x20) return "Accelerometer ID not recognized";
    if (errorStatus & 0x30) return "Math error";
    if (errorStatus & 0x40) return "Gyro ID not recognized";
    if (errorStatus & 0x80) return "Invalid sample rate";
    
    // Ad-hoc
    if (errorStatus & 0x90) return "Failed to put SENtral in pass-through mode";
    if (errorStatus & 0xA0) return "Unable to read from SENtral EEPROM";
    if (errorStatus & 0xB0) return "Unable to upload config to SENtral EEPROM";
    
    return "Unknown error";
}


bool EM7180_HasBaro(void)
{
    return HasFeature(0x01);
}

bool EM7180_HasHumidity(void)
{
    return HasFeature(0x02);
}

bool EM7180_HasTemperature(void)
{
    return HasFeature(0x04);
}

bool EM7180_HasCustom1(void)
{
    return HasFeature(0x08);
}

bool EM7180_HasCustom2(void)
{
    return HasFeature(0x10);
}

bool EM7180_HasCustom3(void)
{
    return HasFeature(0x20);
}

uint8_t EM7180_GetProductId(void) 
{
    return ReadByte(EM7180_ADDRESS, EM7180_ProductID);
}

uint8_t EM7180_GetRevisionId(void) 
{
    return ReadByte(EM7180_ADDRESS, EM7180_RevisionID);
}

uint16_t EM7180_GetRamVersion(void)
{
    uint16_t ram1 = ReadByte(EM7180_ADDRESS, EM7180_RAMVersion1);
    uint16_t ram2 = ReadByte(EM7180_ADDRESS, EM7180_RAMVersion2);
    
    return ram1 << 8 | ram2;
}

uint16_t EM7180_GetRomVersion(void)
{
    uint16_t rom1 = ReadByte(EM7180_ADDRESS, EM7180_ROMVersion1);
    uint16_t rom2 = ReadByte(EM7180_ADDRESS, EM7180_ROMVersion2);
    
    return rom1 << 8 | rom2;
}

void ReadThreeAxis(uint8_t xreg, int16_t *x, int16_t *y, int16_t *z)
{
    uint8_t rawData[6];  // x/y/z register data stored here
    ReadBytes(EM7180_ADDRESS, xreg, 6, rawData);  // Read the six raw data registers sequentially into data array
    *x = (int16_t) (((int16_t)rawData[1] << 8) | rawData[0]);   // Turn the MSB and LSB into a signed 16-bit value
    *y = (int16_t) (((int16_t)rawData[3] << 8) | rawData[2]);  
    *z = (int16_t) (((int16_t)rawData[5] << 8) | rawData[4]); 
}

bool EM7180_Passthru_Begin(void)
{
    // Do generic intialization
    if (!EM7180_EEPROM()) return false;
    
    // First put SENtral in standby mode
    uint8_t c = ReadByte(EM7180_ADDRESS, EM7180_AlgorithmControl);
    WriteByte(EM7180_ADDRESS, EM7180_AlgorithmControl, c | 0x01);
    // Verify standby status
    // if(readByte(EM7180_ADDRESS, EM7180_AlgorithmStatus) & 0x01) {
    // Place SENtral in pass-through mode
    WriteByte(EM7180_ADDRESS, EM7180_PassThruControl, 0x01); 
    if(ReadByte(EM7180_ADDRESS, EM7180_PassThruStatus) & 0x01) {
    }
    else {
        errorStatus = 0x90;
        return false;
    }
    
    uint8_t data[128];
    M24512DFMreadBytes(M24512DFM_DATA_ADDRESS, 0x00, 0x00, 128, data);
    if (data[0] != 0x2A || data[1] != 0x65) {
        errorStatus = 0xA0;
        return false;
    }
    
    // Success
    return true;
}


bool EM7180_Init()
{
    HAL_Delay(500);
    // Sensible defaults for sensor ranges
    uint8_t  aRes = 8;    // Gs
    uint16_t gRes = 2000; // radians per second
    uint16_t mRes = 1000; // microTeslas
    
    // Sensible defaults for sensor Output Data Rates (ODRs)
    uint8_t  magRate      = 100; // Hz
    uint16_t accelRate    = 250; // Hz
    uint16_t gyroRate     = 250; // Hz
    uint8_t  baroRate     = 50;  // Hz
    uint8_t  qRateDivisor = 1;   // 1/3 gyro rate
    
    // Fail immediately if unable to upload EEPROM
    if (!EM7180_EEPROM()){
        return false;
    }
    
    // Enter EM7180 initialized state
    WriteByte(EM7180_ADDRESS, EM7180_HostControl, 0x00); // set SENtral in initialized state to configure registers
    WriteByte(EM7180_ADDRESS, EM7180_PassThruControl, 0x00); // make sure pass through mode is off
    WriteByte(EM7180_ADDRESS, EM7180_HostControl, 0x01); // Force initialize
    WriteByte(EM7180_ADDRESS, EM7180_HostControl, 0x00); // set SENtral in initialized state to configure registers
    
    // Setup LPF bandwidth (BEFORE setting ODR's)
    WriteByte(EM7180_ADDRESS, EM7180_ACC_LPF_BW, 0x03);  // 41Hz
    WriteByte(EM7180_ADDRESS, EM7180_GYRO_LPF_BW, 0x03); // 41Hz
    
    // Set accel/gyro/mage desired ODR rates
    WriteByte(EM7180_ADDRESS, EM7180_QRateDivisor, qRateDivisor-1);    
    WriteByte(EM7180_ADDRESS, EM7180_MagRate, magRate);
    WriteByte(EM7180_ADDRESS, EM7180_AccelRate, accelRate/10); 
    WriteByte(EM7180_ADDRESS, EM7180_GyroRate, gyroRate/10);   
    WriteByte(EM7180_ADDRESS, EM7180_BaroRate, 0x80 | baroRate); // 0x80 = enable bit
    
    // Configure operating mode
    WriteByte(EM7180_ADDRESS, EM7180_AlgorithmControl, 0x00); // read scale sensor data
    
    // Enable interrupt to host upon certain events:
    // quaternions updated (0x04), an error occurs (0x02), or the SENtral needs to be reset(0x01)
    WriteByte(EM7180_ADDRESS, EM7180_EnableEvents, 0x07);
    
    // Enable EM7180 run mode
    WriteByte(EM7180_ADDRESS, EM7180_HostControl, 0x01); // set SENtral in normal run mode
    osDelay(100);
    
    // Disable stillness mode
    SetIntegerParam (0x49, 0x00);
    
    // Write desired sensor full scale ranges to the EM7180
    SetMagAccFs(mRes, aRes);
    SetGyroFs(gRes); 
    // Check event status register to clear the EM7180 interrupt before the main loop
    ReadByte(EM7180_ADDRESS, EM7180_EventStatus); // reading clears the register and interrupt
    
    
    // If readByte() returns 0, return true
    return ReadByte(EM7180_ADDRESS, EM7180_SensorStatus) ? false : true;
}

void EM7180_GetFullScaleRanges(uint8_t *accFs, uint16_t *gyroFs, uint16_t *magFs)
{
    uint8_t param[4];
    
    // Read sensor new FS values from parameter space
    WriteByte(EM7180_ADDRESS, EM7180_ParamRequest, 0x4A); // Request to read  parameter 74
    WriteByte(EM7180_ADDRESS, EM7180_AlgorithmControl, 0x80); // Request parameter transfer process
    uint8_t param_xfer = ReadByte(EM7180_ADDRESS, EM7180_ParamAcknowledge);
    while(!(param_xfer==0x4A)) {
        param_xfer = ReadByte(EM7180_ADDRESS, EM7180_ParamAcknowledge);
    }
    param[0] = ReadByte(EM7180_ADDRESS, EM7180_SavedParamByte0);
    param[1] = ReadByte(EM7180_ADDRESS, EM7180_SavedParamByte1);
    param[2] = ReadByte(EM7180_ADDRESS, EM7180_SavedParamByte2);
    param[3] = ReadByte(EM7180_ADDRESS, EM7180_SavedParamByte3);
    *magFs = ((uint16_t)(param[1]<<8) | param[0]);
    *accFs = ((uint8_t)(param[3]<<8) | param[2]);
    WriteByte(EM7180_ADDRESS, EM7180_ParamRequest, 0x4B); // Request to read  parameter 75
    param_xfer = ReadByte(EM7180_ADDRESS, EM7180_ParamAcknowledge);
    while(!(param_xfer==0x4B)) {
        param_xfer = ReadByte(EM7180_ADDRESS, EM7180_ParamAcknowledge);
    }
    param[0] = ReadByte(EM7180_ADDRESS, EM7180_SavedParamByte0);
    param[1] = ReadByte(EM7180_ADDRESS, EM7180_SavedParamByte1);
    param[2] = ReadByte(EM7180_ADDRESS, EM7180_SavedParamByte2);
    param[3] = ReadByte(EM7180_ADDRESS, EM7180_SavedParamByte3);
    *gyroFs = ((uint16_t)(param[1]<<8) | param[0]);
    WriteByte(EM7180_ADDRESS, EM7180_ParamRequest, 0x00); //End parameter transfer
    WriteByte(EM7180_ADDRESS, EM7180_AlgorithmControl, 0x00); // re-enable algorithm
}

bool EM7180_AlgorithmStatusStandby(void)
{
    return AlgorithmStatus(0x01);
}

bool EM7180_AlgorithmStatusSlow(void)
{
    return AlgorithmStatus(0x02);
}

bool EM7180_AlgorithmStatusStillness(void)
{
    return AlgorithmStatus(0x04);
}

