klaslofstedt/stm32f4_hal_quadcopter/Src/em7180.c
bool EM7180_AlgorithmStatusMagCalibrationCompleted(void)
{
    return AlgorithmStatus(0x08);
}

bool EM7180_AlgorithmStatusMagneticAnomalyDetected(void)
{
    return AlgorithmStatus(0x10);
}

bool EM7180_AlgorithmStatusUnreliableData(void)
{
    return AlgorithmStatus(0x20);
}

bool EM7180_RunStatusNormal()
{
    return (ReadByte(EM7180_ADDRESS, EM7180_RunStatus) & 0x01);
}

void EM7180_CheckEventStatus(void)
{
    // Check event status register, way to check data ready by checkEventStatusing rather than interrupt
    _eventStatus = ReadByte(EM7180_ADDRESS, EM7180_EventStatus); // reading clears the register
    
}

bool EM7180_GotError(void)
{
    if (_eventStatus & 0x02) {
        
        return true;
    }
    
    return false;
}

bool EM7180_GotQuaternion(void)
{
    return _eventStatus & 0x04;
}

bool EM7180_GotMagnetometer(void)
{
    return _eventStatus & 0x08;
}

bool EM7180_GotAccelerometer(void)
{
    return _eventStatus & 0x10;
}

bool EM7180_GotGyrometer(void)
{
    return _eventStatus & 0x20;
}

bool EM7180_GotBarometer(void)
{
    return _eventStatus & 0x40;
}

void EM7180_ReadQuaternion(float *qw, float *qx, float *qy, float *qz)
{
    uint8_t rawData[16];  // x/y/z/w quaternion register data stored here (note unusual order!)
    
    ReadBytes(EM7180_ADDRESS, EM7180_QX, 16, rawData);       
    
    *qx = uint32_RegToFloat(&rawData[0]);
    *qy = uint32_RegToFloat(&rawData[4]);
    *qz = uint32_RegToFloat(&rawData[8]);
    *qw = uint32_RegToFloat(&rawData[12]); 
}

void EM7180_ReadAccelerometer(int16_t *ax, int16_t *ay, int16_t *az)
{
    ReadThreeAxis(EM7180_AX, ax, ay, az);
}

void EM7180_ReadGyrometer(int16_t *gx, int16_t *gy, int16_t *gz)
{
    ReadThreeAxis(EM7180_GX, gx, gy, gz);
}

void EM7180_ReadMagnetometer(int16_t *mx, int16_t *my, int16_t *mz)
{
    ReadThreeAxis(EM7180_MX, mx, my, mz);
}


void EM7180_ReadBarometer(float *pressure, float *temperature)
{
    uint8_t rawData[2];
    
    ReadBytes(EM7180_ADDRESS, EM7180_Baro, 2, rawData);  // Read the two raw data registers sequentially into data array
    int16_t rawPressure =  (int16_t) (((int16_t)rawData[1] << 8) | rawData[0]);   // Turn the MSB and LSB into a signed 16-bit value
    *pressure = (float)rawPressure *.01f + 1013.25f; // pressure in millibars
    
    // get BMP280 temperature
    ReadBytes(EM7180_ADDRESS, EM7180_Temp, 2, rawData);  // Read the two raw data registers sequentially into data array
    int16_t rawTemperature =  (int16_t) (((int16_t)rawData[1] << 8) | rawData[0]);   // Turn the MSB and LSB into a signed 16-bit value
    
    *temperature = (float) rawTemperature*0.01;  // temperature in degrees C
}

uint8_t EM7180_GetActualMagRate()
{
    return ReadByte(EM7180_ADDRESS, EM7180_ActualMagRate);
}

uint16_t EM7180_GetActualAccelRate()
{
    return 10*ReadByte(EM7180_ADDRESS, EM7180_ActualAccelRate);
}

uint16_t EM7180_GetActualGyroRate()
{
    return 10*ReadByte(EM7180_ADDRESS, EM7180_ActualGyroRate);
}

uint8_t EM7180_GetActualBaroRate()
{
    return ReadByte(EM7180_ADDRESS, EM7180_ActualBaroRate);
}

uint8_t EM7180_GetActualTempRate()
{
    return ReadByte(EM7180_ADDRESS, EM7180_ActualTempRate);
}


/* StartEM7180Task function */
void EM7180StartTask(void const * argument)
{                    
    // Quaternions
    float qw, qx, qy, qz;
    // Acceleration in cm/s^2 adjusted without gravity
    float acc_x, acc_y, acc_z;
    // Gyro in m/s(?) (drift free from EM7180?)
    float gyro_x, gyro_y, gyro_z;
    // Angles in degrees
    float yaw, pitch, roll;
    // Gravitational contribution to acceleration
    float a1, a2, a3;
    //
    //bool newAltData = false;
    uint32_t wakeTime = osKernelSysTick();
    uint32_t lastTime = 0;
    
    uint32_t wakeTimeBaro = osKernelSysTick();
    uint32_t lastTimeBaro = 0;
   
	while(1){
        osSemaphoreWait(myBinarySemEM7180InterruptHandle, osWaitForever);
        HAL_GPIO_WritePin(GPIOC, GPIO_PIN_2, GPIO_PIN_SET);
        
        static Em7180Attitude_t *pEm7180Attitude;
        pEm7180Attitude = osMailAlloc(myMailEM7180ToQuadHandle, osWaitForever);
        
        static Em7180Altitude_t *pEm7180Altitude;
        pEm7180Altitude = osMailAlloc(myMailEM7180ToAltHandle, osWaitForever);
        
        EM7180_CheckEventStatus();
        
        if (EM7180_GotError()) {  
            UART_Print("EM7180 error: ");
            UART_Print(EM7180_GetErrorString());
        }
        
        if (EM7180_GotQuaternion()) {             
            EM7180_ReadQuaternion(&qw, &qx, &qy, &qz);
            // Calculate YPR from quaternions
            roll  = atan2(2.0f * (qw * qx + qy * qz), qw * qw - qx * qx - qy * qy + qz * qz);
            pitch = -asin(2.0f * (qx * qz - qw * qy));
            yaw   = atan2(2.0f * (qx * qy + qw * qz), qw * qw + qx * qx - qy * qy - qz * qz);   
            // Convert from rad to deg
            roll    *= 180.0f / M_PI;
            pitch   *= 180.0f / M_PI;
            yaw     *= 180.0f / M_PI; 
            //yaw   += 13.8f; // Declination at Danville, California is 13 degrees 48 minutes and 47 seconds on 2014-04-04
            // Ensure yaw stays between 0 and 360
            if(yaw < 0){
                yaw += 360.0f; 
            }
            // Assign the em7180-to-quadcopter pointer
            pEm7180Attitude->angle.yaw = yaw;
            pEm7180Attitude->angle.pitch = pitch;
            pEm7180Attitude->angle.roll = roll;
        }
        
        if (EM7180_GotGyrometer()) { // 250Hz
            int16_t gx, gy, gz;
            EM7180_ReadGyrometer(&gx, &gy, &gz);
            // Scale the raw gyro into ? TODO: m/s?
            gyro_x = (float)gx / GYRO_SCALE; 
            gyro_y = (float)gy / GYRO_SCALE; 
            gyro_z = (float)gz / GYRO_SCALE; 
            
            pEm7180Attitude->gyro.x = gyro_x;
            pEm7180Attitude->gyro.y = gyro_y;
            pEm7180Attitude->gyro.z = gyro_z;
        }
        
        if (EM7180_GotAccelerometer()){ // 250Hz
            int16_t ax, ay, az;
            EM7180_ReadAccelerometer(&ax, &ay, &az);
            // Scale the raw accelerometer value into G's
            acc_x = (float)ax / ACC_SCALE; 
            acc_y = (float)ay / ACC_SCALE;
            acc_z = (float)az / ACC_SCALE;
            // Calculate the gravitation contribution from quatarions
            a1 = 2.0f * (qx * qz - qw * qy);
            a2 = 2.0f * (qw * qx + qy * qz);
            a3 = qw * qw - qx * qx - qy * qy + qz * qz;
            // Remove gravitation
            acc_x -= a1;
            acc_y -= a2;
            acc_z -= a3;
            // Convert from G's into cm/s^2
            acc_x *= 9.80665f * 100.0f;
            acc_y *= 9.80665f * 100.0f;
            acc_z *= 9.80665f * 100.0f;
            //heading_data.acc_x = acc_x;
            //heading_data.acc_y = acc_y;
            pEm7180Altitude->acc_z = acc_z;
        }
        
        if(EM7180_GotBarometer()) { // 50Hz
            float temperature, pressure;
            EM7180_ReadBarometer(&pressure, &temperature);
            
            float altitude = (1.0f - powf(pressure / 1013.25f, 0.190295f)) * 44330.0f;
            // Calculate the ~50Hz dt
            wakeTimeBaro = osKernelSysTick();
            uint32_t dt_baro = wakeTimeBaro - lastTimeBaro;
            lastTimeBaro = wakeTimeBaro;
            // Assign em7180-to-altitude pointer and convert from ms to s
            pEm7180Altitude->dt_baro = (float)dt_baro*0.001;
            pEm7180Altitude->altitude = altitude;
            //newAltData = true;
        }
        
        // Calculate ~250Hz dt
        wakeTime = osKernelSysTick();
        uint32_t dt = wakeTime - lastTime;
        lastTime = wakeTime;
        // Convert from milliseconds to seconds
        pEm7180Attitude->dt = (float)dt*0.001;
        pEm7180Altitude->dt = (float)dt*0.001;
        
        // Send attitude data by mail to quadcopter task 250 Hz
        osMailPut(myMailEM7180ToQuadHandle, pEm7180Attitude);
        // Send altitude data by mail to altitude task 250 Hz
        osMailPut(myMailEM7180ToAltHandle, pEm7180Altitude);
        
        HAL_GPIO_WritePin(GPIOC, GPIO_PIN_2, GPIO_PIN_RESET);
	}
}